In [69]:
import pandas as pd
import numpy as np

In [70]:
df1 = pd.DataFrame({"letter":["a", "b", "c", "d", "e"], "num":np.arange(5)})

In [71]:
df1

  letter  num
0      a    0
1      b    1
2      c    2
3      d    3
4      e    4

In [72]:
df2 = pd.DataFrame({"letter":["b","d", "e","f"], "num1":np.arange(4)})

In [73]:
df2

  letter  num1
0      b     0
1      d     1
2      e     2
3      f     3

In [74]:
pd.merge(df1, df2)

  letter  num  num1
0      b    1     0
1      d    3     1
2      e    4     2

In [75]:
df1.merge(df2, left_on="letter", right_on="letter")

  letter  num  num1
0      b    1     0
1      d    3     1
2      e    4     2

In [76]:
df1.merge(df2, how = "left", on = "letter")

  letter  num  num1
0      a    0   NaN
1      b    1   0.0
2      c    2   NaN
3      d    3   1.0
4      e    4   2.0

In [77]:
df1.merge(df2, how = "right", on = "letter")

  letter  num  num1
0      b  1.0     0
1      d  3.0     1
2      e  4.0     2
3      f  NaN     3

In [78]:
df1.merge(df2, how = "cross")

   letter_x  num letter_y  num1
0         a    0        b     0
1         a    0        d     1
2         a    0        e     2
3         a    0        f     3
4         b    1        b     0
5         b    1        d     1
6         b    1        e     2
7         b    1        f     3
8         c    2        b     0
9         c    2        d     1
10        c    2        e     2
11        c    2        f     3
12        d    3        b     0
13        d    3        d     1
14        d    3        e     2
15        d    3        f     3
16        e    4        b     0
17        e    4        d     1
18        e    4        e     2
19        e    4        f     3

In [79]:
df1

  letter  num
0      a    0
1      b    1
2      c    2
3      d    3
4      e    4

In [80]:
df2

  letter  num1
0      b     0
1      d     1
2      e     2
3      f     3

In [81]:
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['letter'], dtype='object')

In [82]:
df1.join(df2, lsuffix="_df1", rsuffix = "_df2")

  letter_df1  num letter_df2  num1
0          a    0          b   0.0
1          b    1          d   1.0
2          c    2          e   2.0
3          d    3          f   3.0
4          e    4        NaN   NaN

In [83]:
df1.set_index("letter").join(df2.set_index("letter"))

        num  num1
letter
a         0   NaN
b         1   0.0
c         2   NaN
d         3   1.0
e         4   2.0

In [84]:
tech1 = {"course":["python", "java", "spark", "pandas", "numpy"], "cost": [4500, 2400, 5300, 2300, 5100], "durarion":["20days" ,"40days", "30days", "10days", "50days"]}

In [85]:
df1 = pd.DataFrame(tech1, index = ["r1", "r2", "r3", "r4", "r5"])

In [86]:
df1

    course  cost durarion
r1  python  4500   20days
r2    java  2400   40days
r3   spark  5300   30days
r4  pandas  2300   10days
r5   numpy  5100   50days

In [87]:
dis = {"course":["python", "java", "javascript"], "discount":[1233, 1300, 1100]}

In [88]:
df2 = pd.DataFrame(dis, index = ["r1", "r2", "r6"])

In [89]:
df2

        course  discount
r1      python      1233
r2        java      1300
r6  javascript      1100

In [90]:
df1.join(df2, lsuffix="c_left", rsuffix="c_right", how = "left")

   coursec_left  cost durarion coursec_right  discount
r1       python  4500   20days        python    1233.0
r2         java  2400   40days          java    1300.0
r3        spark  5300   30days           NaN       NaN
r4       pandas  2300   10days           NaN       NaN
r5        numpy  5100   50days           NaN       NaN

In [91]:
df1.join(df2, lsuffix="c_left", rsuffix="r_right", how = "right")

   coursec_left    cost durarion courser_right  discount
r1       python  4500.0   20days        python      1233
r2         java  2400.0   40days          java      1300
r6          NaN     NaN      NaN    javascript      1100

In [92]:
df1.join(df2, lsuffix = "c_left", rsuffix = "c_right", how = "outer")

   coursec_left    cost durarion coursec_right  discount
r1       python  4500.0   20days        python    1233.0
r2         java  2400.0   40days          java    1300.0
r3        spark  5300.0   30days           NaN       NaN
r4       pandas  2300.0   10days           NaN       NaN
r5        numpy  5100.0   50days           NaN       NaN
r6          NaN     NaN      NaN    javascript    1100.0

In [93]:
df1.set_index("course").join(df2.set_index("course"), how = "outer")

              cost durarion  discount
course
java        2400.0   40days    1300.0
javascript     NaN      NaN    1100.0
numpy       5100.0   50days       NaN
pandas      2300.0   10days       NaN
python      4500.0   20days    1233.0
spark       5300.0   30days       NaN

In [94]:
df1.set_index("course").join(df2.set_index("course"), how = "inner")

        cost durarion  discount
course
python  4500   20days      1233
java    2400   40days      1300

In [95]:
df1.merge(df2)

   course  cost durarion  discount
0  python  4500   20days      1233
1    java  2400   40days      1300

In [96]:
df1.merge(df2, on = "course")

   course  cost durarion  discount
0  python  4500   20days      1233
1    java  2400   40days      1300

In [97]:
df1.merge(df2, left_on="course", right_on="course")

   course  cost durarion  discount
0  python  4500   20days      1233
1    java  2400   40days      1300

In [98]:
df1.merge(df2, left_on="course", right_on="course", how = "inner")

   course  cost durarion  discount
0  python  4500   20days      1233
1    java  2400   40days      1300

In [99]:
df1.merge(df2, left_on="course", right_on="course", how = "outer")

       course    cost durarion  discount
0      python  4500.0   20days    1233.0
1        java  2400.0   40days    1300.0
2       spark  5300.0   30days       NaN
3      pandas  2300.0   10days       NaN
4       numpy  5100.0   50days       NaN
5  javascript     NaN      NaN    1100.0

In [100]:
df1.merge(df2, left_on="course", right_on="course", how = "left")

   course  cost durarion  discount
0  python  4500   20days    1233.0
1    java  2400   40days    1300.0
2   spark  5300   30days       NaN
3  pandas  2300   10days       NaN
4   numpy  5100   50days       NaN

In [101]:
df1.merge(df2, left_on="course", right_on="course", how = "right")

       course    cost durarion  discount
0      python  4500.0   20days      1233
1        java  2400.0   40days      1300
2  javascript     NaN      NaN      1100

In [102]:
df = pd.DataFrame({'Courses': ["Spark","PySpark","Python","pandas"],
                    'Fee' : [20000,25000,22000,24000]})

In [103]:
df

   Courses    Fee
0    Spark  20000
1  PySpark  25000
2   Python  22000
3   pandas  24000

In [104]:
df1 = pd.DataFrame({'Courses': ["Pandas","Hadoop","Hyperion","Java"],
                    'Fee': [25000,25200,24500,24900]})

In [105]:
df1

    Courses    Fee
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900

In [106]:
pd.concat([df, df1])

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900

In [107]:
pd.concat([df, df1], ignore_index=True)

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
4    Pandas  25000
5    Hadoop  25200
6  Hyperion  24500
7      Java  24900

In [108]:
pd.concat([df, df1], ignore_index=True, axis=1)

         0      1         2      3
0    Spark  20000    Pandas  25000
1  PySpark  25000    Hadoop  25200
2   Python  22000  Hyperion  24500
3   pandas  24000      Java  24900

In [109]:
pd.concat([df, df1], ignore_index=True, axis = 0)

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    pandas  24000
4    Pandas  25000
5    Hadoop  25200
6  Hyperion  24500
7      Java  24900

In [110]:
df = pd.DataFrame({'Courses': ["Spark","PySpark","Python","Pandas"],
                    'Fee' : [20000,25000,22000,25000]})

df1 = pd.DataFrame({'Courses': ["Pandas","Hadoop","Hyperion","Java","Spark"],
                    'Fee': [25000,25200,24500,24900,20000]})

In [111]:
df

   Courses    Fee
0    Spark  20000
1  PySpark  25000
2   Python  22000
3   Pandas  25000

In [112]:
df1

    Courses    Fee
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900
4     Spark  20000

In [113]:
pd.concat([df, df1], join = "inner", ignore_index=True)

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    Pandas  25000
4    Pandas  25000
5    Hadoop  25200
6  Hyperion  24500
7      Java  24900
8     Spark  20000

In [114]:
pd.concat([df, df1], ignore_index=True, join = "outer")

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    Pandas  25000
4    Pandas  25000
5    Hadoop  25200
6  Hyperion  24500
7      Java  24900
8     Spark  20000

In [115]:
pd.concat([df, df1], keys=["c1","c2"], ignore_index=False)

       Courses    Fee
c1 0     Spark  20000
   1   PySpark  25000
   2    Python  22000
   3    Pandas  25000
c2 0    Pandas  25000
   1    Hadoop  25200
   2  Hyperion  24500
   3      Java  24900
   4     Spark  20000

In [116]:
pd.concat([df, df1], keys=["c1","c2"], ignore_index=True)

    Courses    Fee
0     Spark  20000
1   PySpark  25000
2    Python  22000
3    Pandas  25000
4    Pandas  25000
5    Hadoop  25200
6  Hyperion  24500
7      Java  24900
8     Spark  20000

In [117]:
df

   Courses    Fee
0    Spark  20000
1  PySpark  25000
2   Python  22000
3   Pandas  25000

In [118]:
df1

    Courses    Fee
0    Pandas  25000
1    Hadoop  25200
2  Hyperion  24500
3      Java  24900
4     Spark  20000